# Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
# зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
# третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном
# порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.

# Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение
# и завершать скрипт.

# Importing the necessary packages
from time import sleep


# Starting with the class
class TrafficLight:
    __colour = ['red', 'yellow', 'green']

    # Defining the core function
    def core_function(self):
        i = 0
        while i < 3:
            print(f' Please wait... \n'
                  f'{TrafficLight.__colour[i]}')
            if i == 0:
                sleep(7)
            elif i == 1:
                sleep(5)
            elif i == 2:
                sleep(3)
            i += 1


# Checking if everything runs
TrafficLight = TrafficLight()
TrafficLight.core_function()
